In [3]:
# when working with data frames if we want unique ele in a column we can use .unique()
import pandas as pd
df = pd.read_csv("test.csv")

In [4]:
df["Name"].unique()

array(['John Doe', 'Jane Smith', 'Sam Brown', 'Emily Davis'], dtype=object)

In [5]:
df.head()

          Name  Age  Gender      Occupation
0     John Doe   29    Male        Engineer
1   Jane Smith   34  Female  Data Scientist
2    Sam Brown   22    Male         Student
3  Emily Davis   45  Female         Teacher

In [8]:
df[df['Age']>=25] # finding some rows which matches our conditions

          Name  Age  Gender      Occupation
0     John Doe   29    Male        Engineer
1   Jane Smith   34  Female  Data Scientist
3  Emily Davis   45  Female         Teacher

In [10]:
# to save a dataframe to csv file we use .to_csv(dataframe)
df1 = df[df['Age']>=25]
df1.to_csv("newCsv.csv")

In [11]:
df1

          Name  Age  Gender      Occupation
0     John Doe   29    Male        Engineer
1   Jane Smith   34  Female  Data Scientist
3  Emily Davis   45  Female         Teacher